/*


1. 수를 받는다
2. 받은 수의 위치에 O,X 로 선공자와 후공자에 알맞게 들어감
* 홀수번째 두는 사람(선공자 O) , 짝수번째 두는 사람(후공자 X)
3. 빙고여부 체크 후 빙고면 게임끝, 아니면 계속 진행


let 수1 = parseInt(prompt(`수를 놓을 위치의 번호를 입력하세요`))
let 수2 = parseInt(prompt(`수를 놓을 위치의 번호를 입력하세요`))
let 수3 = parseInt(prompt(`수를 놓을 위치의 번호를 입력하세요`))
let 수4 = parseInt(prompt(`수를 놓을 위치의 번호를 입력하세요`))
let 수5 = parseInt(prompt(`수를 놓을 위치의 번호를 입력하세요`))
let 수6 = parseInt(prompt(`수를 놓을 위치의 번호를 입력하세요`))
let 수7 = parseInt(prompt(`수를 놓을 위치의 번호를 입력하세요`))
let 수8 = parseInt(prompt(`수를 놓을 위치의 번호를 입력하세요`))
let 수9 = parseInt(prompt(`수를 놓을 위치의 번호를 입력하세요`))

let 일 = [0,0]
let 이 = [0,1]
let 삼 = [0,2]
let 사 = [1,0]
let 오 = [1,1]
let 육 = [1,2]
let 칠 = [2,0]
let 팔 = [2,1]
let 구 = [2,2]


let t0 = ['E','E','E']
let t1 = ['E','E','E']
let t2 = ['E','E','E']

// t0[1]='O'
// console.log(t0)


let 수1 = parseInt(prompt(`플레이어 1 은 수를 놓을 위치의 번호를 입력하세요`))
if(수1 == 1){t0[0]=`O`}
else if(수1 == 2){t0[1]=`O`}
else if(수1 == 3){t0[2]=`O`}
else if(수1 == 4){t1[0]=`O`}
else if(수1 == 5){t1[1]=`O`}
else if(수1 == 6){t1[2]=`O`}
else if(수1 == 7){t2[0]=`O`}
else if(수1 == 8){t2[1]=`O`}
else if(수1 == 9){t2[2]=`O`}
else{console.log('플레이어 1은 알맞은 수를 놓지 못해 패배했습니다')}

let 수2 = parseInt(prompt(`플레이어 2 는 수를 놓을 위치의 번호를 입력하세요`))
if(수2 == 1){
    if(t0[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else{t0[0]=`X`}
}
else if(수2 == 2){
    if(t0[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else{t0[1]=`X`}
}
else if(수2 == 3){
    if(t0[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else{t0[2]=`X`}
}
else if(수2 == 4){
    if(t1[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else{t1[0]=`X`}
}
else if(수2 == 5){
    if(t1[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else{t1[1]=`X`}
}
else if(수2 == 6){
    if(t1[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else{t1[2]=`X`}
}
else if(수2 == 7){
    if(t2[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else{t2[0]=`X`}
}
else if(수2 == 8){
    if(t2[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else{t2[1]=`X`}
}else if(수2 == 9){
    if(t2[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else{t2[2]=`X`}
}
else{console.log('플레이어 2 는 알맞은 수를 놓지 못해 패배했습니다')}


let 수3 = parseInt(prompt(`플레이어 1 은 수를 놓을 위치의 번호를 입력하세요`))
if(수3 == 1){
    if(t0[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t0[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t0[0]=`O`}
}
else if(수3 == 2){
    if(t0[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t0[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t0[1]=`O`}
}
else if(수3 == 3){
    if(t0[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t0[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t0[2]=`O`}
}
else if(수3 == 4){
    if(t1[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t1[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t1[0]=`O`}
}
else if(수3 == 5){
    if(t1[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t1[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t1[1]=`O`}
}
else if(수3 == 6){
    if(t1[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t1[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t1[2]=`O`}
}
else if(수3 == 7){
    if(t2[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t2[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t2[0]=`O`}
}
else if(수3 == 8){
    if(t2[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t2[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t2[1]=`O`}
}
else if(수3 == 9){
    if(t2[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t2[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t2[2]=`O`}
}
else{console.log('플레이어 1 은 알맞은 수를 놓지 못해 패배했습니다')}


let 수4 = parseInt(prompt(`플레이어 2 는 수를 놓을 위치의 번호를 입력하세요`))
if(수4 == 1){
    if(t0[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t0[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t0[0]=`X`}
}
else if(수4 == 2){
    if(t0[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t0[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t0[1]=`X`}
}
else if(수4 == 3){
    if(t0[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t0[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t0[2]=`X`}
}
else if(수4 == 4){
    if(t1[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t1[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t1[0]=`X`}
}
else if(수4 == 5){
    if(t1[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t1[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t1[1]=`X`}
}
else if(수4 == 6){
    if(t1[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t1[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t1[2]=`X`}
}
else if(수4 == 7){
    if(t2[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t2[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t2[0]=`X`}
}
else if(수4 == 8){
    if(t2[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t2[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t2[1]=`X`}
}
else if(수4 == 9){
    if(t2[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t2[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t2[2]=`X`}
}
else{console.log('플레이어 2 는 알맞은 수를 놓지 못해 패배했습니다')}


// 5번부터 빙고 검증문 시작

let 수5 = parseInt(prompt(`플레이어 1 은 수를 놓을 위치의 번호를 입력하세요`))
if(수5 == 1){
    if(t0[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t0[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t0[0]=`O`
        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
        else{}
    }
}
else if(수5 == 2){
    if(t0[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t0[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t0[1]=`O`
        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
        else{}
    }
}
else if(수5 == 3){
    if(t0[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t0[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t0[2]=`O`
        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
        else{}
    }
}
else if(수5 == 4){
    if(t1[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t1[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t1[0]=`O`
        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
        else{}
    }
}
else if(수5 == 5){
    if(t1[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t1[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t1[1]=`O`
        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
        else{}
    }
}
else if(수5 == 6){
    if(t1[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t1[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t1[2]=`O`
        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
        else{}
    }
}
else if(수5 == 7){
    if(t2[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t2[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t2[0]=`O`
        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
        else{}
    }
}
else if(수5 == 8){
    if(t2[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t2[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t2[1]=`O`
        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
        else{}
    }
}
else if(수5 == 9){
    if(t2[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
    else if(t2[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
    else{t2[2]=`O`
        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
        else{}
    }
}
else{let 수6 = parseInt(prompt(`플레이어 2 는 수를 놓을 위치의 번호를 입력하세요`))
    if(수6 == 1){
        if(t0[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
        else if(t0[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
        else{t0[0]=`X`
            if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
            else{}
        }
    }
    else if(수6 == 2){
        if(t0[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
        else if(t0[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
        else{t0[1]=`X`
            if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
            else{}
        }
    }
    else if(수6 == 3){
        if(t0[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
        else if(t0[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
        else{t0[2]=`X`
            if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
            else{}
        }
    }
    else if(수6 == 4){
        if(t1[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
        else if(t1[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
        else{t1[0]=`X`
            if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
            else{}
        }
    }
    else if(수6 == 5){
        if(t1[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
        else if(t1[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
        else{t1[1]=`X`
            if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
            else{}
        }
    }
    else if(수6 == 6){
        if(t1[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
        else if(t1[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
        else{t1[2]=`X`
            if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
            else{}
        }
    }
    else if(수6 == 7){
        if(t2[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
        else if(t2[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
        else{t2[0]=`X`
            if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
            else{}
        }
    }
    else if(수6 == 8){
        if(t2[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
        else if(t2[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
        else{t2[1]=`X`
            if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
            else{}
        }
    }
    else if(수6 == 9){
        if(t2[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
        else if(t2[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
        else{t2[2]=`X`
            if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
            else{}
        }
    }
    else{let 수7 = parseInt(prompt(`플레이어 1 은 수를 놓을 위치의 번호를 입력하세요`))
        if(수7 == 1){
            if(t0[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
            else if(t0[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
            else{t0[0]=`O`
                if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                else{}
            }
        }
        else if(수7 == 2){
            if(t0[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
            else if(t0[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
            else{t0[1]=`O`
                if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                else{}
            }
        }
        else if(수7 == 3){
            if(t0[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
            else if(t0[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
            else{t0[2]=`O`
                if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                else{}
            }
        }
        else if(수7 == 4){
            if(t1[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
            else if(t1[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
            else{t1[0]=`O`
                if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                else{}
            }
        }
        else if(수7 == 5){
            if(t1[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
            else if(t1[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
            else{t1[1]=`O`
                if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                else{}
            }
        }
        else if(수7 == 6){
            if(t1[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
            else if(t1[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
            else{t1[2]=`O`
            if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                else{}
            }
        }
        else if(수7 == 7){
            if(t2[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
            else if(t2[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
            else{t2[0]=`O`
                if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                else{}
            }
        }
        else if(수7 == 8){
            if(t2[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
            else if(t2[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
            else{t2[1]=`O`
                if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                else{}
            }
        }
        else if(수7 == 9){
            if(t2[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
            else if(t2[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
            else{t2[2]=`O`
                if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                else{}
            }
        }
        else{let 수8 = parseInt(prompt(`플레이어 2 는 수를 놓을 위치의 번호를 입력하세요`))
            if(수8 == 1){
                if(t0[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
                else if(t0[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
                else{t0[0]=`X`
                    if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
                    else{}
                }
            }
            else if(수8 == 2){
                if(t0[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
                else if(t0[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
                else{t0[1]=`X`
                    if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
                    else{}
                }
            }
            else if(수8 == 3){
                if(t0[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
                else if(t0[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
                else{t0[2]=`X`
                    if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
                    else{}
                }
            }
            else if(수8 == 4){
                if(t1[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
                else if(t1[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
                else{t1[0]=`X`
                    if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
                    else{}
                }
            }
            else if(수8 == 5){
                if(t1[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
                else if(t1[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
                else{t1[1]=`X`
                    if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
                    else{}
                }
            }
            else if(수8 == 6){
                if(t1[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
                else if(t1[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
                else{t1[2]=`X`
                    if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
                    else{}
                }
            }
            else if(수8 == 7){
                if(t2[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
                else if(t2[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
                    else{t2[0]=`X`
                    if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
                    else{}
                }
            }
            else if(수8 == 8){
                if(t2[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
                else if(t2[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
                else{t2[1]=`X`
                    if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
                    else{}
                }
            }
            else if(수8 == 9){
                if(t2[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
                else if(t2[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
                else{t2[2]=`X`
                    if((t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')){console.log('플레이어 2 가 승리하였습니다.')}
                    else{}
                }
            }
            else{let 수9 = parseInt(prompt(`플레이어 1 은 수를 놓을 위치의 번호를 입력하세요`))
                if(수9 == 1){
                    if(t0[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
                    else if(t0[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
                    else{t0[0]=`O`
                        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                        else{}
                    }
                }
                else if(수9 == 2){
                    if(t0[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
                    else if(t0[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
                    else{t0[1]=`O`
                        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                        else{}
                    }
                }
                else if(수9 == 3){
                    if(t0[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
                    else if(t0[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
                    else{t0[2]=`O`
                        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                        else{}
                    }
                }
                else if(수9 == 4){
                    if(t1[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
                    else if(t1[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
                    else{t1[0]=`O`
                        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                        else{}
                    }
                }
                else if(수9 == 5){
                    if(t1[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
                    else if(t1[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
                    else{t1[1]=`O`
                        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                        else{}
                    }
                }
                else if(수9 == 6){
                    if(t1[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
                    else if(t1[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
                    else{t1[2]=`O`
                        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                        else{}
                    }
                }
                else if(수9 == 7){
                    if(t2[0]==`O`){console.log(`이미 'O'가 있습니다.`)}
                    else if(t2[0]==`X`){console.log(`이미 'X'가 있습니다.`)}
                    else{t2[0]=`O`
                        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                        else{}
                    }
                }
                else if(수9 == 8){
                    if(t2[1]==`O`){console.log(`이미 'O'가 있습니다.`)}
                    else if(t2[1]==`X`){console.log(`이미 'X'가 있습니다.`)}
                    else{t2[1]=`O`
                        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                        else{}
                    }
                }
                else if(수9 == 9){
                    if(t2[2]==`O`){console.log(`이미 'O'가 있습니다.`)}
                    else if(t2[2]==`X`){console.log(`이미 'X'가 있습니다.`)}
                    else{t2[2]=`O`
                        if((t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O') || (t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O') || (t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O') || (t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O') || (t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O') || (t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O') || (t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O') || (t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O')){console.log('플레이어 1 이 승리하였습니다.')}
                        else{}
                    }
                }
                else{console.log(`무승부입니다.`)}}}}}









console.log(t0,t1,t2)



// 빙고의 경우의 수

/*

[0,0],[0,1],[0,2]
[1,0],[1,1],[1,2]
[2,0],[2,1],[2,2]
[0,0],[1,0],[2,0]
[0,1],[1,1],[2,1]
[0,2],[1,2],[2,2]
[0,0],[1,1],[2,2]
[0,2],[1,1],[2,0]


let t0 = ['E','E','E']
let t1 = ['E','E','E']
let t2 = ['E','E','E']



t0[0] == 'O' && t0[1] == 'O' && t0[2] == 'O' 
t1[0] == 'O' && t1[1] == 'O' && t1[2] == 'O'
t2[0] == 'O' && t2[1] == 'O' && t2[2] == 'O'
t0[0] == 'O' && t1[0] == 'O' && t2[0] == 'O'
t0[1] == 'O' && t1[1] == 'O' && t2[1] == 'O'
t0[2] == 'O' && t1[2] == 'O' && t2[2] == 'O'
t0[0] == 'O' && t1[1] == 'O' && t2[2] == 'O'
t0[2] == 'O' && t1[1] == 'O' && t2[0] == 'O'

조건문
(t0[0] == 'X' && t0[1] == 'X' && t0[2] == 'X') || (t1[0] == 'X' && t1[1] == 'X' && t1[2] == 'X') || (t2[0] == 'X' && t2[1] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[0] == 'X' && t2[0] == 'X') || (t0[1] == 'X' && t1[1] == 'X' && t2[1] == 'X') || (t0[2] == 'X' && t1[2] == 'X' && t2[2] == 'X') || (t0[0] == 'X' && t1[1] == 'X' && t2[2] == 'X') || (t0[2] == 'X' && t1[1] == 'X' && t2[0] == 'X')

*/
















